import s from "./Aside.module.css";
import {NavLink} from "react-router-dom";
import {Component} from "react";


class Aside extends Component {

    state = {
        noneMenu: true
    }



    activateMenu(e) {
        const bul = this.state.noneMenu;
        this.setState({
            noneMenu: !bul,
        })
    }

    render() {


        return (
            <>
                <aside className={this.state.noneMenu?s.aside:(s.aside+' '+s.active)}>


                    <div className={s.navblock}>
                        <NavLink to={'/CMS/CreatePostPage'} className={s.link}>
                            <svg id="plus" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 66 66" >
                                <path id="Контур_232" data-name="Контур 232"
                                      d="M159.137,244.152H130.076a2.076,2.076,0,1,1,0-4.152h29.061a2.076,2.076,0,0,1,0,4.152Zm0,0"
                                      transform="translate(-111.606 -209.076)" />
                                <path id="Контур_233" data-name="Контур 233"
                                      d="M242.076,161.213A2.077,2.077,0,0,1,240,159.137V130.076a2.076,2.076,0,1,1,4.152,0v29.061A2.077,2.077,0,0,1,242.076,161.213Zm0,0"
                                      transform="translate(-209.076 -111.606)" />
                                <path id="Контур_234" data-name="Контур 234"
                                      d="M58.437,66H7.563A7.569,7.569,0,0,1,0,58.437V7.563A7.569,7.569,0,0,1,7.563,0H58.437A7.569,7.569,0,0,1,66,7.563V58.437A7.569,7.569,0,0,1,58.437,66ZM7.563,4.125A3.442,3.442,0,0,0,4.125,7.563V58.437a3.442,3.442,0,0,0,3.438,3.438H58.437a3.442,3.442,0,0,0,3.438-3.438V7.563a3.442,3.442,0,0,0-3.438-3.438Zm0,0"
                                      />
                            </svg>

                        </NavLink>


                        <NavLink to={'/CMS/AllPosts'} className={s.link}>
                            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 66 66">
                                <path id="search"
                                      d="M25.774,46.392h8.763v5.155H25.774Zm-9.665-.644a3.222,3.222,0,1,0,3.222,3.222A3.221,3.221,0,0,0,16.108,45.748Zm35.7-15.723H25.774V35.18H51.805Zm-35.7-.644A3.222,3.222,0,1,0,19.33,32.6,3.221,3.221,0,0,0,16.108,29.381Zm35.7-14.82H25.774v5.155H51.805Zm-35.7-.645a3.222,3.222,0,1,0,3.222,3.222A3.222,3.222,0,0,0,16.108,13.916ZM5.154,58.248V7.731A2.58,2.58,0,0,1,7.732,5.153H58.249a2.58,2.58,0,0,1,2.577,2.578V36.856h5.155V7.731A7.741,7.741,0,0,0,58.249,0H7.732A7.741,7.741,0,0,0,0,7.731V58.248A7.741,7.741,0,0,0,7.732,65.98H37.5V60.825H7.732a2.58,2.58,0,0,1-2.578-2.577ZM62.354,66l-5.133-5.133a11.611,11.611,0,1,1,3.733-3.558L66,62.353ZM51.29,57.346A6.444,6.444,0,1,0,44.846,50.9,6.45,6.45,0,0,0,51.29,57.346Zm0,0"
                                      transform="translate(0 0.002)"/>
                            </svg>
                        </NavLink>
                    </div>

                    <div className={this.state.noneMenu?(s.Mainlink+' '+s.active):s.Mainlink }  onClick={this.activateMenu.bind(this)}>
                        <svg id="menu" xmlns="http://www.w3.org/2000/svg" width="74.475" height="74.475"
                             viewBox="0 0 74.475 74.475">
                            <g id="Сгруппировать_44" data-name="Сгруппировать 44">
                                <g id="Сгруппировать_43" data-name="Сгруппировать 43">
                                    <path id="Контур_235" data-name="Контур 235"
                                          d="M25.716,0H8.612A8.622,8.622,0,0,0,0,8.612v17.1a8.622,8.622,0,0,0,8.612,8.612h17.1a8.622,8.622,0,0,0,8.612-8.612V8.612A8.622,8.622,0,0,0,25.716,0ZM28.51,25.716a2.8,2.8,0,0,1-2.794,2.794H8.612a2.8,2.8,0,0,1-2.794-2.794V8.612A2.8,2.8,0,0,1,8.612,5.818h17.1A2.8,2.8,0,0,1,28.51,8.612Z"/>
                                </g>
                            </g>
                            <g id="Сгруппировать_46" data-name="Сгруппировать 46" transform="translate(40.147)">
                                <g id="Сгруппировать_45" data-name="Сгруппировать 45">
                                    <path id="Контур_236" data-name="Контур 236"
                                          d="M301.6,0H284.728A8.737,8.737,0,0,0,276,8.728V25.6a8.737,8.737,0,0,0,8.728,8.728H301.6a8.737,8.737,0,0,0,8.728-8.728V8.728A8.737,8.737,0,0,0,301.6,0Zm2.909,25.6A2.912,2.912,0,0,1,301.6,28.51H284.728a2.912,2.912,0,0,1-2.909-2.909V8.728a2.912,2.912,0,0,1,2.909-2.909H301.6a2.912,2.912,0,0,1,2.909,2.909Z"
                                          transform="translate(-276)"/>
                                </g>
                            </g>
                            <g id="Сгруппировать_48" data-name="Сгруппировать 48" transform="translate(0 40.147)">
                                <g id="Сгруппировать_47" data-name="Сгруппировать 47">
                                    <path id="Контур_237" data-name="Контур 237"
                                          d="M25.716,276H8.612A8.622,8.622,0,0,0,0,284.612v17.1a8.622,8.622,0,0,0,8.612,8.612h17.1a8.622,8.622,0,0,0,8.612-8.612v-17.1A8.622,8.622,0,0,0,25.716,276Zm2.794,25.716a2.8,2.8,0,0,1-2.794,2.794H8.612a2.8,2.8,0,0,1-2.794-2.794v-17.1a2.8,2.8,0,0,1,2.794-2.794h17.1a2.8,2.8,0,0,1,2.794,2.794Z"
                                          transform="translate(0 -276)"/>
                                </g>
                            </g>
                            <g id="Сгруппировать_50" data-name="Сгруппировать 50" transform="translate(40.147 40.147)">
                                <g id="Сгруппировать_49" data-name="Сгруппировать 49">
                                    <path id="Контур_238" data-name="Контур 238"
                                          d="M301.6,276H284.728A8.737,8.737,0,0,0,276,284.728V301.6a8.737,8.737,0,0,0,8.728,8.728H301.6a8.737,8.737,0,0,0,8.728-8.728V284.728A8.737,8.737,0,0,0,301.6,276Zm2.909,25.6a2.912,2.912,0,0,1-2.909,2.909H284.728a2.912,2.912,0,0,1-2.909-2.909V284.728a2.912,2.912,0,0,1,2.909-2.909H301.6a2.912,2.912,0,0,1,2.909,2.909Z"
                                          transform="translate(-276 -276)"/>
                                </g>
                            </g>
                        </svg>
                    </div>

                </aside>


            </>
        )
    }
}


export default Aside;